app/Controllers/Kategori.php

SELECT *
FROM `kategori`
 LIMIT 5
SELECT COUNT(*) AS `numrows`
FROM `kategori`
---
    public function index()
    {
        $nohalaman = $this->request->getVar('page_kategori') ? $this->request->getVar('page_kategori') : 1;
        $data = [
            'icon' => 'fas fa-cube',
            'judul' => 'Master Data',
            'subjudul' => ' Kategori',
            'menu' => 'masterdata',
            'submenu' => 'kategori',
            'page' => 'v_kategori',
            // 'kategori' => $this->ModelKategori->AllData(),
            'kategori' => $this->ModelKategori->paginate(5, 'kategori'),
            'pager' => $this->ModelKategori->pager,
            'nohalaman' => $nohalaman
        ];