app/Controllers/Part.php

SELECT *
FROM `part`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `part`
---
    public function index()
    {
        $modelkategori = new ModelKategori();
        $modelsatuan = new ModelSatuan();

        $tombolCariPart  = $this->request->getPost('tombolCariPart');

        if (isset($tombolCariPart)) {
            $caripart = $this->request->getPost('caripart');
            session()->set('cari_part', $caripart);
            return redirect()->to('/part/index');
        } else {
            $caripart = session()->get('cari_part');
        }

        $dataPart = $caripart ? $this->ModelPart->tampildata_cari($caripart)->paginate(10, 'part') : $this->ModelPart->paginate(10, 'part');

        $totaldata = $caripart ? $this->ModelPart->tampildata_cari($caripart)->countAllResults() : $this->ModelPart->AllData()->countAllResults();

        $nohalaman = $this->request->getVar('page_part') ?? 1;

        $data = [
            'icon' => 'fas fa-cube',
            'judul' => 'Master Data',
            'subjudul' => ' Part',
            'menu' => 'masterdata',
            'submenu' => 'part',
            'page' => 'part/v_part',
            'part' => $dataPart,
            // 'part' => $this->ModelPart->paginate(10, 'part'),
            'totaldata' => $totaldata,
            'pager' => $this->ModelPart->pager,
            'nohalaman' => $nohalaman,
            'datakategori' => $modelkategori->AllData(),
            'datasatuan' => $modelsatuan->AllData(),
        ];