app/Controllers/Supplier.php

SELECT *
FROM `supplier`
 LIMIT 10
SELECT COUNT(*) AS `numrows`
FROM `supplier`
---
    public function index()
    {
        $tombolCariSupplier  = $this->request->getPost('tombolCariSupplier');

        if (isset($tombolCariSupplier)) {
            $carisupplier = $this->request->getPost('carisupplier');
            session()->set('cari_supplier', $carisupplier);
            return redirect()->to('/supplier/index');
        } else {
            $carisupplier = session()->get('cari_supplier');
        }

        $dataSupplier = $carisupplier ? $this->ModelSupplier->tampildata_cari($carisupplier)->paginate(10, 'supplier') : $this->ModelSupplier->paginate(10, 'supplier');