app/Controllers/TransaksiMasuk.php

SELECT *
FROM `part`
WHERE `part`.`id_part` = 'OL-0001'
---
    function ambilDataBarang()
    {
        if ($this->request->isAJAX()) {
            $id_part = $this->request->getPost('id_part');

            $modelPart = new ModelPart();
            $ambilData = $modelPart->find($id_part);