app/Models/ModelSupplier.php

SELECT *
FROM `supplier`
---
    public function AllData()
    {
        return $this->db->table('supplier')->get()->getResultArray();