app/Models/ModelJasa.php

    public function AllData()
    {
        return $this->db->table('jasa')->get()->getResultArray();
---
SELECT *
FROM `jasa`