app/Models/ModelPelanggan.php

    public function AllData()
    {
        return $this->db->table('pelanggan')->get()->getResultArray();
---
SELECT *
FROM `pelanggan`

    public function InsertData($data)
    {
        $this->db->table('pelanggan')->insert($data);
---
INSERT INTO `pelanggan` (`nopol`, `nama_pelanggan`, `mobil_pelanggan`, `alamat_pelanggan`, `telp_pelanggan`) VALUES ('AA1234BC', 'Mas Akoi', 'Avanza 2013', 'Banjarnegoro, Mertoyudan, Magelang', '6234567')