app/Models/ModelSatuan.php

SELECT *
FROM `satuan`
---
    public function AllData()
    {
        return $this->db->table('satuan')->get()->getResultArray();