app/Models/ModelPart.php

    public function AllData()
    {
        return $this->db->table('part')->join('kategori', 'id_kategori_part=id_kategori')
            ->join('satuan', 'id_satuan_part=id_satuan')->get()->getResultArray();
---
SELECT *
FROM `part`
JOIN `kategori` ON `id_kategori_part`=`id_kategori`
JOIN `satuan` ON `id_satuan_part`=`id_satuan`

    public function tampildata_cari($caripart)
    {
        return $this->db->table('part')
            ->join('kategori', 'id_kategori_part = id_kategori')
            ->join('satuan', 'id_satuan_part = id_satuan')
            ->groupStart()
            ->like('id_part', $caripart)
            ->orLike('nama_part', $caripart)
            ->orLike('nama_kategori', $caripart)
            ->groupEnd()
            ->get()
            ->getResultArray();
---
SELECT *
FROM `part`
JOIN `kategori` ON `id_kategori_part` = `id_kategori`
JOIN `satuan` ON `id_satuan_part` = `id_satuan`
WHERE   (
`id_part` LIKE '%Oli%' ESCAPE '!'
OR  `nama_part` LIKE '%Oli%' ESCAPE '!'
OR  `nama_kategori` LIKE '%Oli%' ESCAPE '!'
 )