app/Models/ModelTempMasuk.php

SELECT *
FROM `temp_trans_masuk`
JOIN `part` ON `id_part`=`id_part_detbeli`
WHERE `faktur_detbeli` = ''
---
    public function tampilDataTemp($faktur) {
        return $this->table('temp_trans_masuk')->join('part', 'id_part=id_part_detbeli')
        ->where(['faktur_detbeli' => $faktur])->get();