app/Models/ModelTransaksiMasuk.php

    public function getTransaksiMasuk($keyword = null)
    {
        $builder = $this->db->table('transaksi_masuk tm');
        $builder->select('tm.faktur_beli, tm.tgl_beli, tm.id_supp_beli, tm.total_beli, COUNT(dtm.id_detbeli) as jumlah_item');
        $builder->join('det_transaksi_masuk dtm', 'tm.faktur_beli = dtm.faktur_detbeli', 'left');

        if (!empty($keyword)) {
            $builder->groupStart();
            $builder->like('tm.faktur_beli', $keyword);
            $builder->orLike('tm.id_supp_beli', $keyword);
            $builder->groupEnd();
        }

        $builder->groupBy('tm.faktur_beli');
        return $builder->get()->getResultArray();
---
SELECT `tm`.`faktur_beli`, `tm`.`tgl_beli`, `tm`.`id_supp_beli`, `tm`.`total_beli`, COUNT(dtm.id_detbeli) as jumlah_item
FROM `transaksi_masuk` `tm`
LEFT JOIN `det_transaksi_masuk` `dtm` ON `tm`.`faktur_beli` = `dtm`.`faktur_detbeli`
GROUP BY `tm`.`faktur_beli`